# Ultralytics YOLOv11n 自定义结构（官方格式 + 魔改注释）
# 说明：此配置严格遵循Ultralytics list格式，确保解析兼容；自定义模块可在注释位置扩展


nc: 3
names: [R_mask, W_mask, N_mask]

scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]
  - [-1, 1, GAMAttention, [256, 256]]

# === YOLOv11n-Mask-Custom (带 P2 层) ===
# 头部结构：P5->P4->P3->P2，四头输出，极致小目标召回
head:
  # === P5 -> P4 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 2, C3k2, [512, False]] # 14

  # === P4 -> P3 ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 2, C3k2, [256, False]] # 17

  # === P3 -> P2 (新增核心路径) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2
  - [-1, 2, C3k2, [128, False]] # 20

  # === P2 -> P3 (自底向上融合) ===
  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]] # cat head P3
  - [-1, 2, C3k2, [256, False]] # 23

  # === P3 -> P4 ===
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]] # cat head P4
  - [-1, 2, C3k2, [512, False]] # 26

  # === P4 -> P5 ===
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] # cat head P5 (Layer 11 = GAMAttention)
  - [-1, 2, C3k2, [1024, True]] # 29

  # === Detect (4个头) ===
  - [[20, 23, 26, 29], 1, Detect, [nc]]

# 结构说明：
# 1. GAMAttention 置于Backbone末端，P5特征。
# 2. Detect输入为P2、P3、P4、P5四层，极致小目标召回。
# 3. 若backbone结构有变，Concat索引需同步调整。
